package com.app.simon.cardsgame.data

/**
 * desc: Constant
 * date: 2017/8/8

 * @author xw
 */
object Constant {

    /** 角色  */
    val KEY_ROLE = arrayOf("自己", "挚友", "战友", "亲人", "师傅", "爱人")

    /** 主题 */
    val THEME_KNOW_36 = "认识彼此的36个问题"
    val THEME_FRIEND = "好友档案"
    val THEME_DEEP_50 = "深入关系的50个问题"
    val THEME_TODO_50 = "突破关系的50个方案"

    /** 主题  */
    val KEY_THEME = arrayOf(THEME_KNOW_36, THEME_FRIEND, THEME_DEEP_50, THEME_TODO_50)


    /** 好友档案  */
    val VALUE_FRIEND_RECORD = arrayOf(
            "家庭组成是怎样的？关系怎么样呢？",
            "喜欢什么运动？",
            "喜欢什么颜色？",
            "喜欢什么类型的衣服？",
            "喜欢收到什么类型的礼物？",
            "喜欢什么花？",
            "喜欢吃什么水果？",
            "喜欢吃什么零食？",
            "喜欢什么类型的音乐？",
            "看不惯男生的哪些言行举止？",
            "看不惯女生的哪些言行举止？",
            "爱的语言？",
            "容易被激励到的方式？",
            "伤心难过时别人怎样做让你觉得被爱？",
            "关系里最看重的是什么？",
            "关系里最害怕的是什么？",
            "面对冲突和压力你的反应通常是什么？",
            "你的情绪按钮是什么？",
            "最欣赏自己的部分有哪些？",
            "做X后改变比较大的有哪些？",
            "清晰自己需要成长的部分有哪些？",
            "对自己属灵程度的评价是怎样的？",
            "目前有没有那些部分是很困惑你的？",
            "圣经里特别喜欢的人物？",
            "你欣赏的异性的特质有哪些？",
            "你心目中最美好的场景是怎样的或者你一直想做的事情？")

    /** 认识彼此的36问  */
    val VALUE_AMAZING_36 = arrayOf(
            "假如可以选择世界上任何人，你希望邀请谁共进一餐？",
            "你希望成名吗？在哪一方面？",
            "拨打电话前，你会先练习要说的话吗？为什么？",
            "对你来说，怎样才算是“完美”的一天？",
            "上一次唱歌给自己听是什么时候？唱歌给别人听又是什么时候呢？",
            "你愿意能够活到90岁，但你的心智一直停留在30岁吗？",
            "列举3个你和对方共同拥有的特质。",
            "你的人生中最感恩的事情是什么？",
            "假如可以改变你成长过程中的任何事，你希望有哪些改变？",
            "假如明天早上起床后能获得任何一种能力或特质，你希望是什么？",
            "假如有颗水晶球能告诉你关于自己、人生或未来的一切真相，你想知道什么？",
            "有什么事想做很久了？还没去做的原因是？",
            "你人生最大的成就是什么？",
            "友情中你最重视哪一个部份？",
            "你最珍贵的回忆是什么？",
            "你最糟糕的回忆是什么？",
            "如果你知道自己将在一年内突然死去，你会改变自己目前的生活方式吗？为什么？",
            "友情对你而言意味着什么？",

            "爱和感情在你生命里扮演什么样的角色？",
            "分享你认为对方拥有的比较好的性格特点。",
            "你的家庭关系亲密温暖吗？你是否觉得自己的童年比大部分人快乐？",
            "你与母亲的关系如何？",
            "说出3个含有“我们”并且符合实际情况的句子，比如“我们现在都在这个群里”。",
            "完成这个句子：“我希望可以跟某个人分享：”。",
            "如果你要成为对方的好友，有什么事是他或她需要知道的？",
            "告诉对方你欣赏他或她的什么地方？",
            "和对方分享你人生中尴尬的时刻。",
            "上次在别人面前哭是什么时候？自己哭又是什么时候？",
            "告诉对方，你现在欣赏他或她什么地方。",
            "有什么事是绝对不能开玩笑的？",
            "如果你今天晚上就会死掉，而且无法与任何人联系，你最遗憾还没有告诉别人什么事？为什么还没说呢？",
            "你的房子起火了，你所有的东西都在里面。在救出所爱的人和宠物后，你还有时间可以安全地抢救出最后一件东西。你会拿什么？为什么？",
            "分享你人生中的一个问题，问对方遇到这样的问题会怎么做。同时也请对方告诉你，在他或她看来，你对这个问题的感受是什么。")


    /** 深入关系的50问  */
    val VALUE_DEEP_50 = arrayOf(
            "你的父母影响你最多的是哪一个个性？为什么？",
            "你和家中哪个兄弟姊妹(属世)最亲？为什么？",
            "怎么做最能鼓励到你？如何能让你感到被爱？请举一个实际的例子",
            "你如何定义好朋友的关系？最重要的关系特质是？",
            "你希望1年、5年、10年后的你会是什么样子？",
            "你觉得自己最难突破的个性是什么？为什么？我可以为你、或陪你做什么以突破、面对这个个性吗？",
            "门徒生命当中最挑战的时期是何时？为什么呢？",
            "最喜欢自己什么样的个性？为什么？",
            "家庭成员有哪些？彼此互动模式为何？成为门徒后是否有所转变？",
            "成为门徒后成长最多的是什么？怎么说呢？",
            "门徒生命中曾为什么事跟哪位弟兄姊妹发生过冲突？如何面对、解决？",
            "你觉得我是怎样个性的人？也请给我一个改变的建议",
            "你觉得教会弟兄姊妹的关系如何？有哪些成长的空间？我们可以为此从自己开始做些什么？",
            "工作中你曾碰过哪些挑战？你是以什么样的信念去面对、看待呢？",
            "帮人看圣经的过程曾碰过哪些困难与挑战？你如何面对？",
            "你最能被具备什么样特质的人鼓励到？为什么？",
            "你喜欢做的休闲活动是什么？有没有特别喜欢的电影、音乐、戏剧、书籍、绘画、地点？为什么呢？",
            "跟摩西、查经班的关系有哪些鼓励与挑战的地方？",
            "在教会当中你的好朋友有哪些？为什么你们会成为好朋友？",
            "属世上最要好的朋友属于哪个时期？你们之间的关系是如何？",
            "到现在最糗的事情是什么？",
            "你最爱的人是谁(神和耶稣除外)？为什么？",
            "圣经当中影响你最多(或最喜欢)的是哪一本书？为什么？",
            "在教会当中你与谁曾有过最大的冲突？为什么？",
            "今年的愿望是什么？为何会许下这些愿望？",
            "你对姊妹(弟兄)之家的期望是什么？为什么？",
            "你做过最特别的付出为何？",
            "最特别一次的retret的体会？",
            "门徒生命最深的信念为何,能让你坚持走过低潮？",
            "在关系当中最感软弱的地方为何？需要怎样的帮助？",
            "未来想要有怎样的一个家？",
            "如何期许5年、10年后的自己？",
            "最讨厌哪种类型的人,为什么？",
            "影响你最多的弟兄姐妹是谁,为什么？",
            "曾让你最伤心的事？",
            "最感激神的一件事为何？为什么？",
            "对神做过最特别的一件事为何？为什么？",
            "觉得自己的地雷有哪些？",
            "成为门徒前,最大的罪与软弱是、、、？",
            "现在想成长改变的个性是什么？为什么？",
            "你现在的需要是什么？我能为你做什么？",
            "觉得你所住弟兄或姐妹之家的特质为何？你所扮演的角色是什么？",
            "你在关系中最感挫败的部份是什么？为什么？",
            "你觉得自己最能鼓励到别人的特质是什么？你觉得我最能鼓励到别人的特质是什么？",
            "觉得自己在工作上最棒的特质为何？为什么？",
            "最欣赏的弟兄及姐妹的特质为何？为什么？",
            "觉得自己在弟兄或姐妹关系中有哪些传统？",
            "分享最鼓励的Date,以及它为何最鼓励到你？",
            "你希望别人在你的告别式上会如何分享你？",
            "除了神、耶稣、父母,分享你觉得最爱你的人,以及你为何觉得他最能爱到你？")

    /** 突破关系的50个方案  */
    val VALUE_TODO_50 = arrayOf(
            "花时间看彼此从小到大的照片，并分享当中的故事",
            "分享彼此收到最特别的5张卡片，和背后的故事",
            "到对方的家、姊妹之家花时间(以多少了解彼此的成长背景、生活习惯)",
            "动手做菜或做小点心鼓励对方",
            "对方10个很棒的特质、2个需改变的地方，然后对彼此分享",
            "软弱、挑战、Emo时，去找对方一起灵修、祷告",
            "方一起去面对要改变的地方(ex：他若想突破家人关系，可跟他一起做计划并陪他完成)",
            "去做特别的事 (ex：一同Overnight祷告；一起鼓励别人；一起去Date)",
            "此的关系去祷告",
            "一起去Retret跟神花时间",
            "持续关心对方，并follow上次聊到的内容",
            "跟对方分享自己的软弱，并询问对方的意见",
            "买对方需要的小礼物给他",
            "卡片可是礼轻情意重哦！",
            "为突破彼此的关系，去向第三、四者问意见",
            "陪对方去做他喜欢做的事，尽管自己未必喜欢(透过过程更了解对方)",
            "认识对方的家人，了解家人眼中的他",
            "多主动分享自己深层的想法，帮助对方更了解自己",
            "分享彼此的梦想，为他的梦想祷告，并思考如何能Support他的梦想",
            "坚持主动在这关系：felloship、电话、花时间……",
            "对对方说直接的话，并相信他会改变",
            "隔一段时间(如：半年或一年)，主动与对方讨论对这份关系的期望，与可成长的方向",
            "为想鼓励、爱到对方而愿意牺牲自己的……(如：睡眠、感受、个人好恶等)",
            "在觉得软弱、挑战、开心时，主动找对方分享、找对方陪伴",
            "模仿耶稣为对方洗脚",
            "写信寄给对方",
            "列入50个对方很棒的特质去Hornor、感激对方",
            "与对方发生冲突时愿意放下自己，先反省自己需改变什么以突破关系",
            "写下自己对对方“爱的承诺”送给对方",
            "主动、坚持去Invole参与对方的重要时刻(ex：家人生病、低潮需要retret……)",
            "分享自己的想法让对方能了解，尽管是对方难以了解的领域和部分",
            "分享3样对自己很有纪念价值的东西，与背后的故事",
            "作一本彼此关系的纪念册，送给对方",
            "对于对方的分享，很深去思考他的需要，去鼓励对方并为他祷告",
            "时常赞美对方，表达自己对他的欣赏(让他知道自己是深深被欣赏的)",
            "在自己软弱、感到挑战的时候，会第一时间、主动跟对方表达，并寻求他的帮助",
            "(有休假时)给对方Suprise，到他公司鼓励他(带饮料、点心……)",
            "细心观察、聆听对方的需要，送符合他需要或他喜欢的礼物给他",
            "很深的分享自己的想法、感受，尽管那会令人觉得自己很烂，是很负面的声音，还是想让对方知道(出于安全感)！",
            "为帮助他改变和认识自己，给对方直接的建议与挑战！",
            "不仅止于自己和他的关系，也要透过旁人去了解他更多",
            "访问他的好朋友，纪录一本他成长改变过程的纪念册给他",
            "常为对方的需要祷告，并分享自己为对方所做的祷告内容",
            "陪伴他一起去鼓励他的家人、亦与他的家人建立关系",
            "常有彼此认罪祷告的时间",
            "一起去做Radical的决定(ex： Public Preach、在地下道唱歌……)",
            "为彼此持续在属灵上结果子去祷告",
            "画一张代表彼此关系的图送给对方",
            "当他负面想躲起来时，坚持去找他、也坚持带他走出来",
            "愿意先对这份关系有承诺，并与对方表达(ex： 期望跟你成为死党、战友关系……)")


}
